tap "deviceinsight/packages"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "romkatv/powerlevel10k"
brew "xz"
brew "asdf"
brew "aws-okta"
brew "awscli"
brew "azure-cli"
brew "bash-completion"
brew "glib"
brew "cairo"
brew "cmake"
brew "fish"
brew "fzf"
brew "gcc"
brew "libidn2"
brew "hdf5"
brew "netcdf"
brew "numpy"
brew "poppler"
brew "gdal"
brew "gdk-pixbuf"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gobject-introspection"
brew "golangci-lint"
brew "gts"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "jq"
brew "k6"
brew "openjdk"
brew "kafka"
brew "librdkafka"
brew "kcat"
brew "kubectx"
brew "libomp", link: true
brew "llvm@9"
brew "locust"
brew "make"
brew "minikube", link: false
brew "neovim"
brew "node"
brew "qt@5"
brew "poppler-qt5"
brew "postgresql@14", restart_service: true
brew "powerlevel10k"
brew "pure"
brew "pyenv"
brew "pypy3.10"
brew "python@3.10"
brew "python@3.9", link: false
brew "qcachegrind"
brew "r"
brew "redis"
brew "ripgrep"
brew "starship"
brew "staticcheck"
brew "teleport"
brew "telnet"
brew "wget"
brew "zlib"
brew "deviceinsight/packages/kafkactl"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "font-hack-nerd-font"
cask "rstudio"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "alexisvt.flutter-snippets"
vscode "azemoh.one-monokai"
vscode "Dart-Code.dart-code"
vscode "Dart-Code.flutter"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "evondev.dracula-high-contrast"
vscode "file-icons.file-icons"
vscode "GitHub.github-vscode-theme"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "golang.go-nightly"
vscode "hashicorp.terraform"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "johnpapa.winteriscoming"
vscode "KevinRose.vsc-python-indent"
vscode "mhutchie.git-graph"
vscode "MohamedIbrahim.case-changing"
vscode "mohsen1.prettify-json"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "oscarcs.dart-syntax-highlighting-only"
vscode "pbkit.vscode-pbkit"
vscode "PKief.material-icon-theme"
vscode "premparihar.gotestexplorer"
vscode "redhat.vscode-yaml"
vscode "richterger.perl"
vscode "rvest.vs-code-prettier-eslint"
vscode "sainnhe.gruvbox-material"
vscode "teabyii.ayu"
vscode "tomphilbin.gruvbox-themes"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "windmilleng.vscode-go-autotest"
vscode "wmaurer.change-case"
vscode "XadillaX.viml"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
